DylanLockyer/Black_Body/Firmware/stm32_black_body/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "Ring_Buffer.h"
#include "stm32g4xx_hal.h"
#include "switches.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi2;
SPI_HandleTypeDef hspi3;

TIM_HandleTypeDef htim1;

PCD_HandleTypeDef hpcd_USB_FS;

float volt_scale = 0.0;
float resistance_shift = 0.0;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USB_PCD_Init(void);
static void MX_SPI2_Init(void);
static void MX_SPI3_Init(void);
static void MX_I2C3_Init(void);
static void MX_TIM1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

ring_buffer voltage_buff;
ring_buffer current_buff;
ADS131M04 spi_params;
volatile uint8_t adc_flag = 0;
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USB_PCD_Init();
  MX_SPI2_Init();
  MX_SPI3_Init();
  MX_I2C3_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  // Config External ADC read
  ADS131M04 ADS_hdev;
  ADS_hdev.clk_channel = TIM_CHANNEL_1;
  ADS_hdev.clk_htim = &htim1;
  ADS_hdev.cs_port = SPI3_CS_GPIO_Port;
  ADS_hdev.cs_pin = SPI3_CS_Pin;
  ADS_hdev.hspi = &hspi3;

  // Initilize spi_data struct
  Sensor_Data spi_data;

  // Change current parameters and change spi_data struct
  change_current(cur_100ua, right, &spi_data);
  HAL_Delay(1000);
  // Initilise external adc
  ADS131M04_Init(&ADS_hdev);
 
  // ADC buffer
  int32_t reg_data[4] = {0};

  // Ring buffer
  ring_buffer v_buff;
  ring_buffer i_buff; 
  ringBufferInit(&v_buff);
  ringBufferInit(&i_buff);
  // Debugging counter
  //int count = 0;
  while (1)
  {
    // Read adc data once drdy interupt fires
    if (adc_flag == 1){
      ADS131M04_ADC_Read(&ADS_hdev, reg_data);
      // Get shunt resistance value
      float shunt_resistance = 0;
      switch(spi_data.shunt_resistor){
        
        case 0:
          shunt_resistance = 3.2;
          break;
        case 1:
          shunt_resistance = 8.2;
          break;
        case 2:
          shunt_resistance = 503;
          break;
        case 3:
          shunt_resistance = 33200;
          break;
        default:
          shunt_resistance = 1;
          break;

      }

      // Save data to send over spi

      // 6 comes from adc max range of 1.2 * gain of 200 converted to mv
      spi_data.voltage = float_abs(map(reg_data[1], -8388608, 8388607, -6.0, 6.0)) * volt_scale; 

      // 6 comes from adc max range of 1.2 * gain of 200 converted to mv
      // Works on the principle of I = V/R using the shunt resistance
      // Multiply by 1000 to convert to uA
      spi_data.current = float_abs(map(reg_data[0], -8388608, 8388607, -6.0, 6.0)) / shunt_resistance * 1000;
      spi_data.resistance = spi_data.voltage / spi_data.current * 1000 + resistance_shift;

      // Reset drdy flag
      adc_flag = 0;
      external_interface_send(&spi_data, &hspi2);
    }

    autoset_current(&spi_data);

    //Debugging
    //if (count >= 200) {
      //if (spi_data.cur_source == 5) change_current(cur_100ua, right, &spi_data);
      //else if (spi_data.cur_source == 4) change_current(cur_1ma, right, &spi_data);
      //count = 0;
    //}
    //count++;
    //End debugging
    HAL_Delay(5);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV5;
  RCC_OscInitStruct.PLL.PLLN = 68;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C3_Init(void)
{

  /* USER CODE BEGIN I2C3_Init 0 */

  /* USER CODE END I2C3_Init 0 */

  /* USER CODE BEGIN I2C3_Init 1 */

  /* USER CODE END I2C3_Init 1 */
  hi2c3.Instance = I2C3;
  hi2c3.Init.Timing = 0x40B285C2;
  hi2c3.Init.OwnAddress1 = 0;
  hi2c3.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c3.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c3.Init.OwnAddress2 = 0;
  hi2c3.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c3.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c3.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c3) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Analogue filter
  */
  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c3, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Digital filter
  */
  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c3, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C3_Init 2 */

  /* USER CODE END I2C3_Init 2 */

}

/**
  * @brief SPI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI2_Init(void)
{

  /* USER CODE BEGIN SPI2_Init 0 */

  /* USER CODE END SPI2_Init 0 */

  /* USER CODE BEGIN SPI2_Init 1 */

  /* USER CODE END SPI2_Init 1 */
  /* SPI2 parameter configuration*/
  hspi2.Instance = SPI2;
  hspi2.Init.Mode = SPI_MODE_MASTER;
  hspi2.Init.Direction = SPI_DIRECTION_2LINES;
  hspi2.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi2.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi2.Init.CLKPhase = SPI_PHASE_2EDGE;
  hspi2.Init.NSS = SPI_NSS_SOFT;
  hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_64;
  hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi2.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi2.Init.CRCPolynomial = 7;
  hspi2.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi2.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
  if (HAL_SPI_Init(&hspi2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI2_Init 2 */

  /* USER CODE END SPI2_Init 2 */

}

/**
  * @brief SPI3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI3_Init(void)
{

  /* USER CODE BEGIN SPI3_Init 0 */

  /* USER CODE END SPI3_Init 0 */

  /* USER CODE BEGIN SPI3_Init 1 */

  /* USER CODE END SPI3_Init 1 */
  /* SPI3 parameter configuration*/
  hspi3.Instance = SPI3;
  hspi3.Init.Mode = SPI_MODE_MASTER;
  hspi3.Init.Direction = SPI_DIRECTION_2LINES;
  hspi3.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi3.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi3.Init.CLKPhase = SPI_PHASE_2EDGE;
  hspi3.Init.NSS = SPI_NSS_SOFT;
  hspi3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
  hspi3.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi3.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi3.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi3.Init.CRCPolynomial = 7;
  hspi3.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi3.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
  if (HAL_SPI_Init(&hspi3) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI3_Init 2 */

  /* USER CODE END SPI3_Init 2 */

}

/**
  * @brief TIM1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM1_Init(void)
{

  /* USER CODE BEGIN TIM1_Init 0 */

  /* USER CODE END TIM1_Init 0 */

  TIM_MasterConfigTypeDef sMasterConfig = {0};
  TIM_OC_InitTypeDef sConfigOC = {0};
  TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig = {0};

  /* USER CODE BEGIN TIM1_Init 1 */

  /* USER CODE END TIM1_Init 1 */
  htim1.Instance = TIM1;
  htim1.Init.Prescaler = 0;
  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim1.Init.Period = 20;
  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;
  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_PWM_Init(&htim1) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
  sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
  sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
  sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
  sBreakDeadTimeConfig.DeadTime = 0;
  sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
  sBreakDeadTimeConfig.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
  sBreakDeadTimeConfig.BreakFilter = 0;
  sBreakDeadTimeConfig.BreakAFMode = TIM_BREAK_AFMODE_INPUT;
  sBreakDeadTimeConfig.Break2State = TIM_BREAK2_DISABLE;
  sBreakDeadTimeConfig.Break2Polarity = TIM_BREAK2POLARITY_HIGH;
  sBreakDeadTimeConfig.Break2Filter = 0;
  sBreakDeadTimeConfig.Break2AFMode = TIM_BREAK_AFMODE_INPUT;
  sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
  if (HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM1_Init 2 */

  /* USER CODE END TIM1_Init 2 */
  HAL_TIM_MspPostInit(&htim1);

}

/**
  * @brief USB Initialization Function
  * @param None
  * @retval None
  */
static void MX_USB_PCD_Init(void)
{

  /* USER CODE BEGIN USB_Init 0 */

  /* USER CODE END USB_Init 0 */

  /* USER CODE BEGIN USB_Init 1 */

  /* USER CODE END USB_Init 1 */
  hpcd_USB_FS.Instance = USB;
  hpcd_USB_FS.Init.dev_endpoints = 8;
  hpcd_USB_FS.Init.speed = PCD_SPEED_FULL;
  hpcd_USB_FS.Init.phy_itface = PCD_PHY_EMBEDDED;
  hpcd_USB_FS.Init.Sof_enable = DISABLE;
  hpcd_USB_FS.Init.low_power_enable = DISABLE;
  hpcd_USB_FS.Init.lpm_enable = DISABLE;
  hpcd_USB_FS.Init.battery_charging_enable = DISABLE;
  if (HAL_PCD_Init(&hpcd_USB_FS) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USB_Init 2 */

  /* USER CODE END USB_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, sel_v_1ma_Pin|i_source_sel4_Pin|i_source_sel3_Pin|i_source_sel2_Pin
                          |i_sense_sel1_Pin|sel_100na_pos_Pin|i_source_sel1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, i_sense_sel2_Pin|i_sense_sel3_Pin|hbridge_sel4_Pin|i_sense_sel4_Pin
                          |hbridge_sel3_Pin|hbridge_sel1_Pin|hbridge_sel2_Pin|sel_10na_pos_Pin
                          |SPI3_CS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, sel_100na_neg_Pin|sel_t_1ma_Pin|sel_t_1ua_Pin|sel_10na_neg_Pin
                          |SPI2_CS_Pin|sel_v_100ua_Pin|sel_v_1ua_Pin|sel_t_100ua_Pin
                          |sel_t_10ua_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(sel_v_10ua_GPIO_Port, sel_v_10ua_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : sel_v_1ma_Pin i_source_sel4_Pin i_source_sel3_Pin i_source_sel2_Pin
                           i_sense_sel1_Pin sel_100na_pos_Pin i_source_sel1_Pin */
  GPIO_InitStruct.Pin = sel_v_1ma_Pin|i_source_sel4_Pin|i_source_sel3_Pin|i_source_sel2_Pin
                          |i_sense_sel1_Pin|sel_100na_pos_Pin|i_source_sel1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : ADC_DRDY_Pin */
  GPIO_InitStruct.Pin = ADC_DRDY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(ADC_DRDY_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : i_sense_sel2_Pin i_sense_sel3_Pin hbridge_sel4_Pin i_sense_sel4_Pin
                           hbridge_sel3_Pin hbridge_sel1_Pin hbridge_sel2_Pin sel_10na_pos_Pin
                           SPI3_CS_Pin */
  GPIO_InitStruct.Pin = i_sense_sel2_Pin|i_sense_sel3_Pin|hbridge_sel4_Pin|i_sense_sel4_Pin
                          |hbridge_sel3_Pin|hbridge_sel1_Pin|hbridge_sel2_Pin|sel_10na_pos_Pin
                          |SPI3_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : sel_100na_neg_Pin sel_t_1ma_Pin sel_t_1ua_Pin sel_10na_neg_Pin
                           SPI2_CS_Pin sel_v_100ua_Pin sel_v_1ua_Pin sel_t_100ua_Pin
                           sel_t_10ua_Pin */
  GPIO_InitStruct.Pin = sel_100na_neg_Pin|sel_t_1ma_Pin|sel_t_1ua_Pin|sel_10na_neg_Pin
                          |SPI2_CS_Pin|sel_v_100ua_Pin|sel_v_1ua_Pin|sel_t_100ua_Pin
                          |sel_t_10ua_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : sel_v_10ua_Pin */
  GPIO_InitStruct.Pin = sel_v_10ua_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(sel_v_10ua_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
  if (GPIO_Pin == ADC_DRDY_Pin){
    adc_flag = 1;
  } else {
    __NOP();
  }
}


void set_shunt(current source_current, Sensor_Data *data){
  // Set shunt based on current source
  cur_resistor shunt_resistor = 0;
  if (source_current < 2){
    shunt_resistor = _33k2;
  }
  else if (source_current < 4){
    shunt_resistor = _500;
  }
  else if (source_current < 5){
    shunt_resistor = _5;
  }
  else if (source_current < 6){
    shunt_resistor = none;
  } 
  else {
    shunt_resistor = disable;
  }
  current_measurement_resistor(shunt_resistor);
  
  // Update shunt value sent to esp32
  data->shunt_resistor = shunt_resistor;
}

void autoset_current(Sensor_Data *spi_data){
  int changed = 0;
  switch((int)spi_data->cur_source){
    //case 0:
      //if (spi_data->voltage < 0.06){
        //current_source(cur_100na);
        //spi_data->cur_source = cur_100na;
        //HAL_Delay(100);
      //}
      //break;
    //case 1:
      //if (spi_data->voltage < 0.2){
        //current_source(cur_1ua);
        //spi_data->cur_source = cur_1ua;
        //HAL_Delay(100);
      //}
      //else if (spi_data->voltage > 0.8){
        //current_source(cur_10na);
        //spi_data->cur_source = cur_10na;
        //HAL_Delay(100);
      //}
      //break;
    //case 2:
      //if (spi_data->voltage < 0.5){
        //current_source(cur_10ua);
        //spi_data->cur_source = cur_10ua;
        //HAL_Delay(100);
      //}
      //else if (spi_data->voltage > 3){
        //current_source(cur_100na);
        //spi_data->cur_source = cur_100na;
        //HAL_Delay(100);
      //}
      //break;
    case 3:
      if (spi_data->voltage < 0.4){
        current_source(cur_100ua, &volt_scale, &resistance_shift);
        spi_data->cur_source = cur_100ua;
        changed = 1;
      }
      //else if (spi_data->voltage > 5.0){
        //current_source(cur_1ua);
        //spi_data->cur_source = cur_1ua;
        //HAL_Delay(100);
      //}
      break;
    case 4:
      if (spi_data->voltage < 0.4){
        current_source(cur_1ma, &volt_scale, &resistance_shift);
        spi_data->cur_source = cur_1ma;
        changed = 1;
      }
      else if (spi_data->voltage > 5.0){
        current_source(cur_10ua, &volt_scale, &resistance_shift);
        spi_data->cur_source = cur_10ua;
        changed = 1;
      }
      break;
    case 5:
      if (spi_data->voltage > 5.0){
        current_source(cur_100ua, &volt_scale, &resistance_shift);
        spi_data->cur_source = cur_100ua;
        HAL_Delay(100);
        changed = 1;
      }
      break;
  }
  if (changed == 1){
    set_shunt(spi_data->cur_source, spi_data);
  }
}

void change_current(current source_current, cur_direction direction, Sensor_Data *data){
  current_source(source_current, &volt_scale, &resistance_shift);
  current_direction(direction);

  set_shunt(source_current, data);

  // Update data to send to ESP32
  data->cur_direction = direction;
  data->cur_source = source_current;
}

float map(uint32_t x, uint32_t x_min, uint32_t x_max, float y_min, float y_max){
  return (float)(x - x_min) * (y_max - y_min) / (float)(x_max - x_min) + y_min;
}

float float_abs(float x){
  if (x >= 0.0) return x;
  else return x * (-1);
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
